from thefuzz import fuzz

def get_region(text):
    words = text.split()
    regions = {
        "Lviv": ["Львів", "Львівський", "Львів'янин", "Галичина","Стрий","Яворів"],
        "Kyiv": ["Київ", "Київський", "Київлянин","Троєщина","Кличко"],
        "Odesa": ["Одеса", "Одеський", "Одесит"],
        "Kharkiv": ["Харків", "Харківський", "Харків'янин"],
        "Dnipro": ["Дніпро", "Дніпропетровськ", "Дніпрянин","Павлоград"],
        "Zaporizhia": ["Запоріжжя", "Запорізький", "Запоріжець","Мелітополь"],
        "Vinnytsia": ["Вінниця", "Вінницький", "Вінничанин"],
        "Volyn": ["Луцьк", "Волинський", "Волинянин"],
        "Transcarpathia": ["Ужгород", "Закарпатський", "Закарпатець","Мукачево"],
        "Zhytomyr": ["Житомир", "Житомирський", "Житомирянин"],
        "IvanoFrankivsk": ["Івано-Франківськ", "Івано-Франківський", "Галичина","Буковель"],
        "Kropyvnytskyi": ["Кропивницький", "Кіровоград", "Кіровоградський", "Кіровоградець"],
        "Luhansk": ["Луганськ", "Луганська область", "Луганчанин","Лисичанськ"],
        "Lutsk": ["Луцьк", "Волинський", "Волинянин","Лукьций","Ковель","Ковельський"],
        "Mykolaiv": ["Миколаїв", "Миколаївський", "Миколаївець"],
        "Poltava": ["Полтава", "Полтавський", "Полтавчанин","Кременчук","Пирятин","Лубни","Миргород","Кременчуцький"],
        "Rivne": ["Рівне", "Рівненський", "Рівнянин","Дубно"],
        "Sumy": ["Суми", "Сумський", "Сумчанин"],
        "Ternopil": ["Тернопіль", "Тернопільський", "Тернополянин"],
        "Kherson": ["Херсон", "Херсонський", "Херсонець","Олешки"],
        "Cherkasy": ["Черкаси", "Черкаський", "Черкащанин","Умань","Уманський"],
        "Chernihiv": ["Чернігів", "Чернігівський", "Чернігів'янин"],
        "Chernivtsi": ["Чернівці", "Чернівецький", "Чернівчанин"],
        "Crimea": ["Крим", "Севастополь", "Сімферополь", "Ялта","Кримський"],
	    "Donetsk":["Донецьк","Маруіполь","Маруіпольський","Донецький","Донеччанин","Донецька область"]
    }

    for region, region_words in regions.items():
        for word in words:
            for region_word in region_words:
                if fuzz.ratio(word, region_word) > 65:
                    print(region)
                    return region
    print("Region unavailable")
    return None
